/* Даны координаты точки, не лежащей на координатных осях OX и OY.
 * Определить номер координатной четверти, в которой находится данная точка.
 */

#include <iostream>

int main()
{
	float x, y;

	std::cout << "введите координаты точки\n";
	std::cin >> x >> y;

	if (x > 0 && y > 0)
	{
		std::cout << 1 << "\n";
	}
	else
	{
		if (x < 0 && y > 0)
		{
			std::cout << 2 << "\n";
		}
		else
		{	
			if (x < 0 && y < 0)
			{
				std::cout << 3 << "\n";
			}
			else
			{			
				if (x > 0 && y < 0)
				{
					std::cout << 4 << "\n";
				}
				else
				{
					std::cout << "точка находится на осях или в центре координат\n";
				}
			}
		}
	}

	return 0;			
}

// Сократить до 2 std::cout