/* Даны целочисленные координаты трех вершин прямоугольника,
 * стороны которого параллельны координатным осям.
 * Найти координаты его четвертой вершины.
 */

 //недоделано

#include <iostream>

int main()
{
	int x1, y1, x2, y2, x3, y3;

	std::cout << "введите координаты первой вершины\n";
	std::cin >> x1 >> y1;

	std::cout << "\nвведите координаты второй вершины\n";
	std::cin >> x2 >> y2;

	std::cout << "\nвведите координаты третьей вершины\n";
	std::cin >> x3 >> y3;


} 