/* Даны три целых числа. Найти количество положительных
 * и количество отрицательных чисел в исходном наборе.
 */

#include <iostream>

int main()
{
	int a, b, c;

	std::cout << "введите три целых числа\n";
	std::cin >> a >> b >> c;

	return 0;
} 

// Решение не верное
